Terraform Format and Style: success
Terraform Initialization: success
Terraform Validation: success
Terraform Plan: success

<details><summary>Show Plan</summary>

```

module.egress-space.data.cloudfoundry_org.org: Reading...
module.database.data.cloudfoundry_service.rds: Reading...
module.database.data.cloudfoundry_space.space: Reading...
module.csv_upload_bucket.data.cloudfoundry_service.s3: Reading...
module.contact_list_bucket.data.cloudfoundry_space.space: Reading...
module.contact_list_bucket.data.cloudfoundry_service.s3: Reading...
module.csv_upload_bucket.data.cloudfoundry_space.space: Reading...
module.redis.data.cloudfoundry_space.space: Reading...
module.redis.data.cloudfoundry_service.redis: Reading...
module.egress-space.data.cloudfoundry_org.org: Read complete after 0s [id=9e428562-a2d9-41b4-9c23-1ef5237fb44e]
module.egress-space.data.cloudfoundry_user.users["ryan.ahearn@gsa.gov"]: Reading...
module.egress-space.data.cloudfoundry_user.users["bbb35677-6906-4f8d-b230-bb4755d7886a"]: Reading...
module.database.data.cloudfoundry_space.space: Read complete after 0s [id=0b28b133-9f7b-49f1-9f34-a179cbb2549f]
module.egress-space.data.cloudfoundry_user.users["steven.reilly@gsa.gov"]: Reading...
module.egress-space.data.cloudfoundry_user.users["bbb35677-6906-4f8d-b230-bb4755d7886a"]: Read complete after 0s [id=74b9cc1c-d8fa-4e70-8eba-c7d66343ad9c]
module.contact_list_bucket.data.cloudfoundry_service.s3: Read complete after 0s [id=440ce9d9-b108-4bbe-80b4-08338f3cc25b]
module.egress-space.data.cloudfoundry_user.users["ryan.ahearn@gsa.gov"]: Read complete after 0s [id=6ca5b315-3eec-4e1f-a2a7-d22c3fe3508b]
module.database.data.cloudfoundry_service.rds: Read complete after 0s [id=dcfb1d43-f22c-42d3-962c-7ae04eda24e7]
module.database.cloudfoundry_service_instance.rds: Refreshing state... [id=9360890e-0458-41d0-99ce-071ce7f5bef9]
module.redis.data.cloudfoundry_service.redis: Read complete after 0s [id=045871d3-d9a8-4a9b-a844-00a067fab054]
module.contact_list_bucket.data.cloudfoundry_space.space: Read complete after 0s [id=0b28b133-9f7b-49f1-9f34-a179cbb2549f]
module.contact_list_bucket.cloudfoundry_service_instance.bucket: Refreshing state... [id=d8ef4688-128d-49af-8997-a5d1ccb64fcc]
module.csv_upload_bucket.data.cloudfoundry_service.s3: Read complete after 0s [id=440ce9d9-b108-4bbe-80b4-08338f3cc25b]
module.redis.data.cloudfoundry_space.space: Read complete after 0s [id=0b28b133-9f7b-49f1-9f34-a179cbb2549f]
module.redis.cloudfoundry_service_instance.redis: Refreshing state... [id=c6d73ed7-69ba-4720-a459-7b80200006c8]
module.csv_upload_bucket.data.cloudfoundry_space.space: Read complete after 0s [id=0b28b133-9f7b-49f1-9f34-a179cbb2549f]
module.csv_upload_bucket.cloudfoundry_service_instance.bucket: Refreshing state... [id=59028298-4427-4516-907d-097d99dda5c5]
module.egress-space.data.cloudfoundry_user.users["steven.reilly@gsa.gov"]: Read complete after 1s [id=ffd00a3e-aa1a-42e1-a81a-5f60420658c2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.egress-space.cloudfoundry_space.public_egress will be created
  + resource "cloudfoundry_space" "public_egress" {
      + allow_ssh  = (known after apply)
      + auditors   = (known after apply)
      + developers = (known after apply)
      + id         = (known after apply)
      + managers   = (known after apply)
      + name       = "notify-demo-egress"
      + org        = "9e428562-a2d9-41b4-9c23-1ef5237fb44e"
    }

  # module.egress-space.cloudfoundry_space_users.deployers will be created
  + resource "cloudfoundry_space_users" "deployers" {
      + auditors   = (known after apply)
      + developers = [
          + "6ca5b315-3eec-4e1f-a2a7-d22c3fe3508b",
          + "74b9cc1c-d8fa-4e70-8eba-c7d66343ad9c",
          + "ffd00a3e-aa1a-42e1-a81a-5f60420658c2",
        ]
      + force      = false
      + id         = (known after apply)
      + managers   = [
          + "6ca5b315-3eec-4e1f-a2a7-d22c3fe3508b",
          + "74b9cc1c-d8fa-4e70-8eba-c7d66343ad9c",
          + "ffd00a3e-aa1a-42e1-a81a-5f60420658c2",
        ]
      + space      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rahearn, Action: `pull_request`*